ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/SHAW_0.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="SHAW" HW_revision="0.0">
    <group id="SHAW_GPRCM" name="SHAW_GPRCM" instances="1" offset="0x800" instaddr="0x100" description="">
        <register id="SHAW_PWREN" width="32" offset="0x0" description="Power enable">
            <bitfield id="ENABLE" description="Enable the power" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable Power"/>
                <bitenum id="ENABLE" value="0x1" description="Enable Power"/>
            </bitfield>
        </register>
        <register id="SHAW_RSTCTL" width="32" offset="0x4" description="Reset Control">
            <bitfield id="RESETSTKYCLR" description="Clear the RESETSTKY bit in the STAT register" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear reset sticky bit"/>
            </bitfield>
            <bitfield id="RESETASSERT" description="Assert reset to the peripheral" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="ASSERT" value="0x1" description="Assert reset"/>
            </bitfield>
        </register>
        <register id="SHAW_STAT" width="32" offset="0x14" description="Status Register">
            <bitfield id="RESETSTKY" description="This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register" begin="16" end="16" width="1" rwaccess="R">
                <bitenum id="NORES" value="0x0" description="The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register"/>
                <bitenum id="RESET" value="0x1" description="The peripheral was reset since the last bit clear"/>
            </bitfield>
        </register>
        </group>
    <register id="SHAW_SHAW_PUB0_IIDX" width="32" offset="0x1020" description="PUB0 IIDX register">
        <bitfield id="STAT" description="This register provides the highest priority enabled interrupt index. Value 0x00 means no event pending. Interrupt 1 is the highest priority, IIDX next highest, 4, 8, ... IIDX^31 is the least priority. That is, the least bit position that is set to 1 denotes the highest priority pending interrupt. The priority order is fixed. However, users can implement their own prioritization schemes using other registers that expose the full set of interrupts that have occurred. On each read, only one interrupt is indicated. On a read, the current interrupt (highest priority) is automatically cleared by the hardware and the corresponding interrupt flag in [RIS] and [MIS] are cleared as well. After a read from the CPU (not from the debug interface), the register is updated with the next highest priority interrupt, if none are pending, then it should display 0x0." begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="SHAW_SHAW_PUB0_IMASK" width="32" offset="0x1028" description="PUB0 IMASK register">
        <bitfield id="OUTPUTRDY" description="Interrupt Mask. If a bit is set, then corresponding interrupt is un-masked. Un-masking the interrupt causes the raw interrupt to be visible in IIDX, as well as MIS." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SHAW_SHAW_PUB0_RIS" width="32" offset="0x1030" description="PUB0 RIS register">
        <bitfield id="OUTPUTRDY" description="Raw interrupt status. Reflects all pending interrupts, regardless of masking. The RIS register allows the user to implement a poll scheme. A flag set in this register can be cleared by writing 1 to the ICLR register bit even if the corresponding IMASK bit is not enabled." begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="SHAW_SHAW_PUB0_MIS" width="32" offset="0x1038" description="PUB0 MIS register">
        <bitfield id="OUTPUTRDY" description="Masked interrupt status. This is an AND of the IMASK and RIS registers." begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="SHAW_SHAW_PUB0_ISET" width="32" offset="0x1040" description="PUB0 ISET register">
        <bitfield id="OUTPUTRDY" description="Interrupt set. Allows interrupts to be set by software (useful in diagnostics and safety checks). Writing a 1 to a bit in ISET will set the event and therefore the related RIS bit also gets set. If the interrupt is enabled through the mask, then the corresponding MIS bit is also set." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SHAW_SHAW_PUB0_ICLR" width="32" offset="0x1048" description="PUB0 ICLR register">
        <bitfield id="OUTPUTRDY" description="Interrupt clear. Write a 1 to clear corresponding Interrupt." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SHAW_SHAW_PUB1_IIDX" width="32" offset="0x1050" description="PUB1 IIDX register">
        <bitfield id="STAT" description="This register provides the highest priority enabled interrupt index. Value 0x00 means no event pending. Interrupt 1 is the highest priority, IIDX next highest, 4, 8, ... IIDX^31 is the least priority. That is, the least bit position that is set to 1 denotes the highest priority pending interrupt. The priority order is fixed. However, users can implement their own prioritization schemes using other registers that expose the full set of interrupts that have occurred. On each read, only one interrupt is indicated. On a read, the current interrupt (highest priority) is automatically cleared by the hardware and the corresponding interrupt flag in [RIS] and [MIS] are cleared as well. After a read from the CPU (not from the debug interface), the register is updated with the next highest priority interrupt, if none are pending, then it should display 0x0." begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="SHAW_SHAW_PUB1_IMASK" width="32" offset="0x1058" description="PUB1 IIDX register">
        <bitfield id="DMA_START_TRIGGER" description="Interrupt Mask. If a bit is set, then corresponding interrupt is un-masked. Un-masking the interrupt causes the raw interrupt to be visible in IIDX, as well as MIS." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SHAW_SHAW_PUB1_RIS" width="32" offset="0x1060" description="PUB1 RIS register">
        <bitfield id="DMA_START_TRIGGER" description="Raw interrupt status. Reflects all pending interrupts, regardless of masking. The RIS register allows the user to implement a poll scheme. A flag set in this register can be cleared by writing 1 to the ICLR register bit even if the corresponding IMASK bit is not enabled." begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="SHAW_SHAW_PUB1_MIS" width="32" offset="0x1068" description="PUB1 MIS register">
        <bitfield id="DMA_START_TRIGGER" description="Masked interrupt status. This is an AND of the IMASK and RIS registers." begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="SHAW_SHAW_PUB1_ISET" width="32" offset="0x1070" description="PUB1 ISET register">
        <bitfield id="DMA_START_TRIGGER" description="Interrupt set. Allows interrupts to be set by software (useful in diagnostics and safety checks). Writing a 1 to a bit in ISET will set the event and therefore the related RIS bit also gets set. If the interrupt is enabled through the mask, then the corresponding MIS bit is also set." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SHAW_SHAW_PUB1_ICLR" width="32" offset="0x1078" description="PUB1 ICLR register">
        <bitfield id="DMA_START_TRIGGER" description="Interrupt clear. Write a 1 to clear corresponding Interrupt." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SHAW_SHAW_DMA_START_TRIGGER" width="32" offset="0x1080" description="DMA Start Trigger Register">
        <bitfield id="START_TRIGGER" description="Trigger to start DMA" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SHAW_SHAW_DATA_FIXED" width="32" offset="0x1100" description="Fixed Address Wrie Register">
    </register>
    <register id="SHAW_EIP59_DATA_IN0_" width="32" offset="0x1200" description="SHA Data IN 0 register">
    </register>
    <register id="SHAW_EIP59_DATA_IN1_" width="32" offset="0x1204" description="SHA Data IN 1 register">
    </register>
    <register id="SHAW_EIP59_DATA_IN2_" width="32" offset="0x1208" description="SHA Data IN 2 register">
    </register>
    <register id="SHAW_EIP59_DATA_IN3_" width="32" offset="0x120C" description="SHA Data IN 3 register">
    </register>
    <register id="SHAW_EIP59_DATA_IN4_" width="32" offset="0x1210" description="SHA Data IN 4 register">
    </register>
    <register id="SHAW_EIP59_DATA_IN5_" width="32" offset="0x1214" description="SHA Data IN 5 register">
    </register>
    <register id="SHAW_EIP59_DATA_IN6_" width="32" offset="0x1218" description="SHA Data IN 6 register">
    </register>
    <register id="SHAW_EIP59_DATA_IN7_" width="32" offset="0x121C" description="SHA Data IN 7 register">
    </register>
    <register id="SHAW_EIP59_DATA_IN8_" width="32" offset="0x1220" description="SHA Data IN 8 register">
    </register>
    <register id="SHAW_EIP59_DATA_IN9_" width="32" offset="0x1224" description="SHA Data IN 9 register">
    </register>
    <register id="SHAW_EIP59_DATA_IN10_" width="32" offset="0x1228" description="SHA Data IN 10 register">
    </register>
    <register id="SHAW_EIP59_DATA_IN11_" width="32" offset="0x122C" description="SHA Data IN 11 register">
    </register>
    <register id="SHAW_EIP59_DATA_IN12_" width="32" offset="0x1230" description="SHA Data IN 12 register">
    </register>
    <register id="SHAW_EIP59_DATA_IN13_" width="32" offset="0x1234" description="SHA Data IN 13 register">
    </register>
    <register id="SHAW_EIP59_DATA_IN14_" width="32" offset="0x1238" description="SHA Data IN 14 register">
    </register>
    <register id="SHAW_EIP59_DATA_IN15_" width="32" offset="0x123C" description="SHA Data IN 15 register">
    </register>
    <register id="SHAW_EIP59_IO_BUF_CTRL_STAT" width="32" offset="0x1240" description="SHA Status Register">
        <bitfield id="OUTBUF_FULL" description="Indicates output is available, needs to be written 1 to clear this bit before starting new hash" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DATA_IN_AV" description="Indicates that the EIP59_DATA_IN_x registers contain a new input data block for processing. #br#The Host must write a 1b to this bit to start an operation on the data in EIP59_DATA_IN_x as soon as the EIP-59 engine is ready to process new input data. #br#Alternatively, when DMA is selected, asserting input signal dma_in_clear to 1b must be used instead to start processing new input data. As an exception, the data_in_av bit must only be used to start processing a zero length message. #br#Writing a '0' to the data_in_av bit has no effect. #br#This bit is automatically cleared (i.e. reads 0b) when the Wide bus EIP-59 engine has copied the EIP59_DATA_IN_x contents. This bit reads as 1b between the time it was set by the Host and the Wide bus EIP-59 engine has started processing the new input block." begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="LENGTH_IN_AV" description="Write 1 to indicate length is available" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="MODE_IN_AV" description="Write 1 to indicate mode is available" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="IDIGEST_IN_AV" description="Write 1 to indicate idigest is available" begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="ODIGEST_IN_AV" description="Write 1 to indicate odigest is available" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PAD_MESSAGE" description="Write 1 to pad the message" begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="GET_DIGEST" description="Write 1 to get the digest on the digest out registers" begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="IDIGEST_OUT_AV" description="Status to indicate idigest out is available" begin="12" end="12" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="ODIGEST_OUT_AV" description="Status to indicate odigest out is available" begin="13" end="13" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="SHAW_EIP59_MODE_IN" width="32" offset="0x1244" description="SHA Mode Register">
        <bitfield id="HASH_HMAC" description="Write 1 to indicate if it is hmac operation" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="MAC_KEY" description="Write 1 to indicate mac key computation" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="NEW_HASH" description="Write 1 to indicate new hash computation" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SHA_256" description="Write 1 to compute hash in sha 256 mode, while reading back this information will be available in 3rd bit instead of 5th bit and 5th bit remains reserved" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SHA_224" description="Write 1 to compute hash in sha 224 mode, while reading back this information will be available in 4rd bit instead of 6th bit and 6th bit remains reserved" begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SHAW_EIP59_LENGTH_IN_L" width="32" offset="0x1248" description="Data Length Register LSB">
    </register>
    <register id="SHAW_EIP59_LENGTH_IN_H" width="32" offset="0x124C" description="Data Length Register MSB">
    </register>
    <register id="SHAW_EIP59_IDIGEST_A" width="32" offset="0x1250" description="SHA IDIGEST Register">
    </register>
    <register id="SHAW_EIP59_IDIGEST_B" width="32" offset="0x1254" description="SHA IDIGEST Register">
    </register>
    <register id="SHAW_EIP59_IDIGEST_C" width="32" offset="0x1258" description="SHA IDIGEST Register">
    </register>
    <register id="SHAW_EIP59_IDIGEST_D" width="32" offset="0x125C" description="SHA IDIGEST Register">
    </register>
    <register id="SHAW_EIP59_IDIGEST_E" width="32" offset="0x1260" description="SHA IDIGEST Register">
    </register>
    <register id="SHAW_EIP59_IDIGEST_F" width="32" offset="0x1264" description="SHA IDIGEST Register">
    </register>
    <register id="SHAW_EIP59_IDIGEST_G" width="32" offset="0x1268" description="SHA IDIGEST Register">
    </register>
    <register id="SHAW_EIP59_IDIGEST_H" width="32" offset="0x126C" description="SHA IDIGEST Register">
    </register>
    <register id="SHAW_EIP59_ODIGEST_A" width="32" offset="0x1270" description="SHA ODIGEST Register">
    </register>
    <register id="SHAW_EIP59_ODIGEST_B" width="32" offset="0x1274" description="SHA ODIGEST Register">
    </register>
    <register id="SHAW_EIP59_ODIGEST_C" width="32" offset="0x1278" description="SHA ODIGEST Register">
    </register>
    <register id="SHAW_EIP59_ODIGEST_D" width="32" offset="0x127C" description="SHA ODIGEST Register">
    </register>
    <register id="SHAW_EIP59_ODIGEST_E" width="32" offset="0x1280" description="SHA ODIGEST Register">
    </register>
    <register id="SHAW_EIP59_ODIGEST_F" width="32" offset="0x1284" description="SHA ODIGEST Register">
    </register>
    <register id="SHAW_EIP59_ODIGEST_G" width="32" offset="0x1288" description="SHA ODIGEST Register">
    </register>
    <register id="SHAW_EIP59_ODIGEST_H" width="32" offset="0x128C" description="SHA ODIGEST Register">
    </register>
    <register id="SHAW_EIP59_DIGEST_A" width="32" offset="0x1290" description="SHA DIGEST OUT Result Register">
    </register>
    <register id="SHAW_EIP59_DIGEST_B" width="32" offset="0x1294" description="SHA DIGEST OUT Result Register">
    </register>
    <register id="SHAW_EIP59_DIGEST_C" width="32" offset="0x1298" description="SHA DIGEST OUT Result Register">
    </register>
    <register id="SHAW_EIP59_DIGEST_D" width="32" offset="0x129C" description="SHA DIGEST OUT Result Register">
    </register>
    <register id="SHAW_EIP59_DIGEST_E" width="32" offset="0x12A0" description="SHA DIGEST OUT Result Register">
    </register>
    <register id="SHAW_EIP59_DIGEST_F" width="32" offset="0x12A4" description="SHA DIGEST OUT Result Register">
    </register>
    <register id="SHAW_EIP59_DIGEST_G" width="32" offset="0x12A8" description="SHA DIGEST OUT Result Register">
    </register>
    <register id="SHAW_EIP59_DIGEST_H" width="32" offset="0x12AC" description="SHA DIGEST OUT Result Register">
    </register>
    <register id="SHAW_EIP59_CONFIG" width="32" offset="0x12F8" description="SHA Configuration Register">
    </register>
    <register id="SHAW_EIP59_VERSION" width="32" offset="0x12FC" description="SHA Version Register">
    </register>

</module>